/* ===== Generic ===== */

/* Generic Cancel button title, used in SKConversation NSErrorFromPREMIUM_VIDEO_STATUS */
"BUTTONTITLE_CANCEL" = "Batal";

/* ===== SkyLib Properties ===== */

/* List item title for user's home phone number. */
"CONTACT_PHONE_HOME" = "Rumah";

/* List item title for user's office phone number */
"CONTACT_PHONE_OFFICE" = "Pejabat";

/* List item title for user's mobile phone number. */
"CONTACT_PHONE_MOBILE" = "Telefon Bimbit";

/* List item title for user's (possible) other phone number(s). */
"CONTACT_PHONE_OTHER" = "Lain-lain";

/* Format to use to wrap guest contact displays */
"CONTACT_GUEST_FORMAT" = "%@ (Tetamu)";

/* All known contacts group title */
"CONTACT_GROUP_ALL_KNOWN_CONTACTS" = "Semua Kenalan Yang Diketahui";

/* All buddies group title */
"CONTACT_GROUP_ALL_BUDDIES" = "Semua Kenalan";

/* Skype group title */
"CONTACT_GROUP_SKYPE_BUDDIES" = "Kenalan Skype";

/* SkypeOut group title */
"CONTACT_GROUP_SKYPEOUT_BUDDIES" = "Nombor Telefon Yang Disimpan";

/* Online buddies group title */
"CONTACT_GROUP_ONLINE_BUDDIES" = "Kenalan Dalam Talian";

/* Unknown or pending auth group title */
"CONTACT_GROUP_UNKNOWN_OR_PENDINGAUTH_BUDDIES" = "Permintaan Dihantar";

/* Recently contacted group title */
"CONTACT_GROUP_RECENTLY_CONTACTED_CONTACTS" = "Terbaru Dihubungi";

/* Contacts waiting my auth group title */
"CONTACT_GROUP_CONTACTS_WAITING_MY_AUTHORIZATION" = "Permintaan Diterima";

/* Authorized by me group title */
"CONTACT_GROUP_CONTACTS_AUTHORIZED_BY_ME" = "Permintaan Diterima";

/* Blocked group title */
"CONTACT_GROUP_CONTACTS_BLOCKED_BY_ME" = "Kenalan Disekat";

/* Ungrouped contacts group title */
"CONTACT_GROUP_UNGROUPED_BUDDIES" = "Kenalan Tanpa Kumpulan";

/* Windows Live ID contacts group title */
"CONTACT_GROUP_PASSPORT_CONTACTS" = "Messenger";

/* Suggested contacts group title */
"CONTACT_GROUP_SCD_CONTACTS" = "Kenalan Cadangan";

/* New group default title */
"CONTACT_GROUP_NEW_GROUP" = "Senarai Tanpa Tajuk";

/* Default message sent to contacts from whom we are requesting authorization */
"CONTACT_AUTH_REQUEST_DEFAULT_MESSAGE" = "Sila tambahkan saya sebagai kenalan";

/*  */
"ECHO123_CONTACT_FULLNAME" = "Panggilan ujian Skype";

/*  */
"ECHO123_CONTACT_LANGUAGES" = "ms";

/*  */
"ECHO123_CONTACT_HOMEPAGE" = "www.skype.com/go/help";

/* Automatic sound test service mood message. */
"ECHO123_CONTACT_ABOUT" = "Hai, ini robot panggilan ujian Skype. Tambahkan saya pada kenalan anda dan panggil saya untuk menyemak persediaan bunyi anda. Lihat http://www.skype.com/go/help untuk bantuan lanjut. Terima kasih.";

/*  */
"ECHO123_CONTACT_MOOD_TEXT" = "Panggil saya untuk menguji bunyi anda";


/* UNPLACED call status used when a call is initialized, but not connected to the network yet. */
"CALL_STATUS_UNPLACED" = "Menyediakan panggilan anda";

/* ROUTING call status used when a call is being routed by the network but not ringing yet. */
"CALL_STATUS_ROUTING" = "Menyediakan panggilan anda";

/* CANCELLED call status indicating that the outgoing call was cancelled by the user. */
"CALL_STATUS_CANCELLED" = "Panggilan dibatalkan";

/* FAILED call status used when the call failed. */
"CALL_STATUS_FAILED" = "Panggilan gagal";

/* RINGING_OUT call status used when a call is ringing for the remote party. */
"CALL_STATUS_RINGING_OUT" = "Berdering";

/* RINGING_IN call status used when a call is ringing locally. */
"CALL_STATUS_RINGING_IN" = "Memanggil";

/* LOCALHOLD call status indicating that the user put the call on hold. */
"CALL_STATUS_LOCALHOLD" = "Panggilan ditunda";

/* REMOTEHOLD call status indicating that the call is on hold by the remote party. */
"CALL_STATUS_REMOTEHOLD" = "Anda ditunda";

/* FINISHED call status indicating that the call was finished. */
"CALL_STATUS_FINISHED" = "Selesai";

/* MISSED call status indicating that the incoming call was finished before it got answered. */
"CALL_STATUS_MISSED" = "Terlepas";

/* REFUSED call status indicating that the remote party declined the call. */
"CALL_STATUS_REFUSED" = "Ditolak";

/* BUSY call status indicating that the remote party was already in a call. */
"CALL_STATUS_BUSY" = "Sibuk";

/* DROPPED call status indicating that the network connection was lost during the call. */
"CALL_STATUS_DROPPED" = "Terputus sambungan";

/* VOICEMAIL call status indicating that the call was diverted to voicemail. */
"CALL_STATUS_VOICEMAIL" = "Mesej suara";

/* VM_RECORDING call status while recording the voicemail. */
"CALL_STATUS_VM_RECORDING" = "Merakam mesej suara";

/* VM_UPLOADING call status while sending the voicemail. */
"CALL_STATUS_VM_UPLOADING" = "Menghantar mesej suara";

/* VM_SENT call status after the voicemail was sent. */
"CALL_STATUS_VM_SENT" = "Mesej suara dihantar";

/* VM_CANCELLED call status when the recording or sending of the voicemail was cancelled. */
"CALL_STATUS_VM_CANCELLED" = "Mesej suara dibatalkan";

/* VM_FAILED call status when the recording or sending of the voicemail failed. */
"CALL_STATUS_VM_FAILED" = "Mesej suara gagal";

/* ===== Wallet Transacation ===== */
/* Title of instrument name in popup button (args: instrument name ["Visa"], number ["****1234"]) */
"WALLET_INSTRUMENT_DISPLAY_NAME_FORMAT" = "%1$@ %2$@";


/* ===== PARTICIPANT_VOICE_STATUS ===== */ 

/* VOICE_CONNECTING status used when a call is being routed by the network but not ringing yet. */
"PARTICIPANT_VOICE_STATUS_CONNECTING" = "Menyambung";

/* RINGING status when a participant is ringing. */
"PARTICIPANT_VOICE_STATUS_RINGING" = "Berdering";

/* EARLY_MEDIA status when a participant is ringing. */
"PARTICIPANT_VOICE_STATUS_EARLY_MEDIA" = "Berdering";

/* ON_HOLD status when a participant is held. */
"PARTICIPANT_VOICE_STATUS_ON_HOLD" = "Ditunda";

/* STOPPED status when a participant has stopped. */
"PARTICIPANT_VOICE_STATUS_STOPPED" = "Tamat";

/* FACEBOOK calling */
"PARTICIPANT_VOICE_STATUS_CONNECTING_FACEBOOK" = "Memanggil pada Facebook (Beta)";

/* ===== CONVERSATION_LOCAL_LIVESTATUS ===== */ 
"CONVERSATION_LOCAL_LIVESTATUS_STARTING" = "Memanggil…";
"CONVERSATION_LOCAL_LIVESTATUS_RINGING_FOR_ME" = "Memanggil…";
"CONVERSATION_LOCAL_LIVESTATUS_IM_LIVE" = "Panggilan sedang berlangsung";
"CONVERSATION_LOCAL_LIVESTATUS_ON_HOLD_LOCALLY" = "Ditunda";
"CONVERSATION_LOCAL_LIVESTATUS_ON_HOLD_REMOTELY" = "Anda ditunda";
"CONVERSATION_LOCAL_LIVESTATUS_OTHERS_ARE_LIVE" = "Panggilan sedang berlangsung";
"CONVERSATION_LOCAL_LIVESTATUS_OTHERS_ARE_LIVE_FULL" = "Panggilan sudah penuh";
"CONVERSATION_LOCAL_LIVESTATUS_PLAYING_VOICE_MESSAGE" = "Memainkan kata alu-aluan mesej suara";
"CONVERSATION_LOCAL_LIVESTATUS_RECORDING_VOICE_MESSAGE" = "Merakam mesej suara";
"CONVERSATION_LOCAL_LIVESTATUS_RECENTLY_LIVE" = "Panggilan terbaru";
"CONVERSATION_LOCAL_LIVESTATUS_TRANSFERRING" = "Memindahkan panggilan ini";


/*  */
"CONVERSATION_POST_FILES_BODY" = "Fail disiarkan";

/* CONVERSATION Legacy chat message for older clients */
"CONVERSATION_VIDEOMESSAGE_LEGACY_MESSAGE" = "Anda telah menerima mesej video. Lihatnya pada: %1, dan buka dengan kod %2";

"CONVERSATION_XMM_LEGACY_MESSAGE" = "%1$@ - lihatnya pada %%1.";

"CONVERSATION_MEDIAMESSAGE_LEGACY_MESSAGE" = "Untuk melihat foto kongsi ini, pergi ke: %1";
"CONVERSATION_XMM_MESSAGE_LEGACY_MESSAGE" = "Untuk melihat media kongsi ini, pergi ke: %1";

/*  */
"CONTACT_AVAILABILITY_OFFLINE" = "Luar Talian";
"CONTACT_AVAILABILITY_ONLINE" = "Dalam Talian";
"CONTACT_AVAILABILITY_AWAY" = "Tiada";
"CONTACT_AVAILABILITY_DO_NOT_DISTURB" = "Jangan Ganggu";
"CONTACT_AVAILABILITY_PENDING_AUTH" = "Permintaan kenalan menunggu";
"CONTACT_AVAILABILITY_BLOCKED" = "Disekat";
"CONTACT_AVAILABILITY_OFFLINE_BUT_VM_ABLE" = "Luar talian dengan pemesejan suara";
"CONTACT_AVAILABILITY_OFFLINE_BUT_CF_ABLE" = "Pemajuan panggilan";

/*  */
"CONTACT_AVAILABILITY_INVISIBLE" = "Halimunan";
"CONTACT_AVAILABILITY_CONNECTING" = "Menyambung";
"CONTACT_AVAILABILITY_SKYPEOUT" = "Nombor telefon";

/*  */
"CONTACT_GENDER_FEMALE" = "Perempuan";

/*  */
"CONTACT_GENDER_MALE" = "Lelaki";

/* A hidden phone number. */
"CONTACT_UNKNOWN_PSTN_DISPLAYNAME" = "Nombor tidak diketahui";

/* Title for conversation with no participants */
"CONVERSATION_UNTITLED_DISPLAYNAME" = "Tidak bertajuk";


"ACCOUNTMANAGER_LOGIN_STATUS" = "Mendaftar masuk…";
"ACCOUNTMANAGER_CBLSYNC_STATUS" = "Memuatkan kenalan…";
"ACCOUNTMANAGER_UPGRADEDB_STATUS" = "Menaik taraf fail…";


/* Chat info message when a party has been joined to the chat. %1$@ is the name of the user who did the adding, while %2$@ is the name of the added user. */
"ChatMessage::ADDEDMEMBERS_FORMATSTRING" = "%1$@ telah menambahkan %2$@";

/* Chat info message shown when user %@ has left the chat. */
"ChatMessage::LEFT_FORMATSTRING" = "%@ telah keluar";

/* Chat info message when the first user ejected (threw out) the second user from the chat. */
"ChatMessage::KICKED_FORMATSTRING" = "%1$@ telah mengalih keluar %2$@";

/* Chat info message shown when a party has changed the chat topic. %1$@ is the user who did it, and %2$@ the new topic. */
"ChatMessage::SETTOPIC_FORMATSTRING" = "%1$@ telah mengubah topik sembang kepada %2$@";

/* Chat item shown in place of the message to tell that the message has been removed by its writer. */
"CHATMESSAGE_MESSAGEREMOVED_TEXT" = "Mesej ini telah dialihkan keluar";

/* AV Preferences output device name */
"SAME_AS_SYSTEM_DEVICE_NAME" = "Sama seperti Sistem";


/* ===== SkyLib Error/Result Codes ===== */

/* sync errors at login/registration */
"LOGOUTREASON_NETWORKERROR" = "Tidak dapat menyambung ke Skype.";
"LOGOUTREASON_NETWORKERROR_RECOVERYSUGGESTION" = "Sila semak tetapan rangkaian anda dan cuba lagi.";

/* sync errors at registration */
"Account::INVALID_SKYPENAME" = "Nama Skype ini tidak sah.";
"Account::INVALID_EMAIL" = "Alamat e-mel ini tidak sah.";
"Account::INVALID_EMAIL_RECOVERYSUGGESTION" = "Sila semak dan cuba lagi.";
"Account::UNACCEPTABLE_PASSWORD" = "Kata laluan ini tidak sah.";
"Account::SKYPENAME_TAKEN" = "Nama Skype ini telah diguna.";
"Account::SKYPENAME_TAKEN_RECOVERYSUGGESTION" = "Sila masukkan nama baru.";

/* sync errors at login */
"Account::NO_SUCH_IDENTITY" = "Kami tidak mengenali Nama Skype dan kata laluan anda.";
"Account::INCORRECT_PASSWORD" = "Kami tidak mengenali Nama Skype dan kata laluan anda.";
"Account::TOO_MANY_LOGIN_ATTEMPTS" = "Terlalu banyak percubaan daftar masuk yang gagal.";
"Account::TOO_MANY_LOGIN_ATTEMPTS_RECOVERYSUGGESTION" = "Sila cuba lagi kemudian.";

/* async errors (can happen anytime while logged in) */
"Account::PASSWORD_HAS_CHANGED" = "Kata laluan anda telah berubah.";
"Account::PASSWORD_HAS_CHANGED_RECOVERYSUGGESTION" = "Sila daftar masuk dengan kata laluan baru anda.";

"LOGOUTREASON_GENERIC_RECOVERYSUGGESTION" = "Sila cuba lagi.";

/* Account property validation error - NSLocalizedFailureReasonErrorKey [#HELLC-1021], [#WIN-364] */
"SkyLib::TOO_SHORT" = "Panjangnya mestilah 6-20 aksara.";
"SkyLib::TOO_LONG" = "Panjangnya mestilah 6-20 aksara.";
"SkyLib::CONTAINS_INVALID_CHAR" = "Aksara tidak sah cth. Σ, à, ß.";
"SkyLib::CONTAINS_SPACE" = "Tidak boleh mengandungi ruang atau tab.";
"SkyLib::SAME_AS_USERNAME" = "Terlalu serupa dengan Nama Skype anda.";
"SkyLib::INVALID_FORMAT" = "Format tidak sah.";
"SkyLib::CONTAINS_INVALID_WORD" = "Terlalu mudah untuk diteka cth. abcd, skype.";
"SkyLib::TOO_SIMPLE" = "Perlu mempunyai sekurang-kurangnya 1 huruf dan 1 nombor.";
"SkyLib::STARTS_WITH_INVALID_CHAR" = "Mesti bermula dengan huruf (A–Z).";

/* Account property validation error - NSLocalizedRecoverySuggestionErrorKey */
"SkyLib::TOO_SHORT_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Cuba Nama Skype yang lebih panjang.";
"SkyLib::TOO_SHORT_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Cuba kata laluan yang lebih panjang.";
"SkyLib::TOO_LONG_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Cuba Nama Skype yang lebih pendek.";
"SkyLib::TOO_LONG_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Cuba kata laluan yang lebih pendek.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Cuba Nama Skype baru.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Cuba kata laluan baru.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_CONTACT_EMAILS" = "Cuba alamat e-mel baru.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION" = "Cuba nilai baru.";

/* Account password change error - NSLocalizedFailureReasonErrorKey */
"Account::PWD_INVALID_OLD_PASSWORD" = "Kata laluan salah.";
"Account::PWD_SERVER_CONNECT_FAILED" = "Tidak dapat menyambung ke pelayan.";
"Account::PWD_MUST_DIFFER_FROM_OLD" = "Kata laluan baru mestilah berbeza dengan kata laluan lama.";
"Account::PWD_INVALID_NEW_PWD" = "Kata laluan tidak sah.";
"Account::PWD_MUST_LOG_IN_TO_CHANGE" =  "Mestilah mendaftar masuk untuk mengubah kata laluan anda.";

/* COMMITFAILED status received when committing a server-side property change. */
"ACCOUNT_COMMITSTATUS_COMMIT_FAILED" = "Perubahan anda tidak dapat disimpan. Semak tetapan dan cuba lagi.";

"ACCOUNT_NOCREDIT" = "Tiada kredit";
"ACCOUNT_FREECALL" = "Panggilan percuma";

/* Conversation file transfer errors */
"SkyLib::TRANSFER_BAD_FILENAME" = "Nama fail tidak sah";
"SkyLib::TRANSFER_OPEN_FAILED" = "Gagal membuka fail";
"SkyLib::TRANSFER_TOO_MANY_PARALLEL" = "Terlalu banyak pemindahan fail yang serentak";

/* ===== SKSkypeKitErrorDomain Errors ===== */

/* SKErrorOffline */
"SKERROR_OFFLINE_DESCRIPTION" = "Anda berada di luar talian.";

"SKERROR_OFFLINE_CALL_FAILUREREASON" = "Anda perlu berada dalam talian untuk membuat panggilan.";
"SKERROR_OFFLINE_CONTACTSEARCH_FAILUREREASON" = "Anda tidak boleh mencari kenalan apabila anda berada di luar talian. Ubah status anda dan cuba lagi.";
"SKERROR_OFFLINE_SMS_FAILUREREASON" = "Anda perlu berada dalam talian untuk menghantar SMS.";

/* [#HELLC-894] */
"SKERROR_OFFLINE_VOICEMAIL_FAILUREREASON" = "Anda perlu berada dalam talian untuk memainkan mesej ini.";

/* Alert sheet title */
"SKERROR_CANNOT_SET_BODY_SMS_DESCRIPTION" = "Tidak dapat menetapkan isi SMS semasa.";


/* SKErrorInsufficientFunds */
"Sms::INSUFFICIENT_FUNDS" = "Anda tidak mempunyai Kredit Skype yang mencukupi untuk menghantar SMS.";
"CMEMBER_PSTN_STATUSTEXT_INSUFFICIENTCREDIT" = "Anda memerlukan Kredit Skype untuk menghubungi nombor ini.";

/* SKErrorInvalidContact */
"SKERROR_INVALIDCONTACT" = "Nama Skype atau nombor telefon tersebut tidak sah.";

/* SKErrorCallOfflineLyncContact */
"SKERROR_OFFLINELYNCCONTACT_CALL_FAILUREREASON" = "Anda tidak dapat memanggil kenalan Lync ini kerana mereka berada di luar talian.";

/* SKErrorBlockedContact */
"SKERROR_CONTACTBLOCKED_CALL_FAILUREREASON" = "Anda tidak boleh memanggil individu ini kerana anda telah menyekatnya.";
"SKERROR_CONTACTBLOCKED_CHAT_FAILUREREASON" = "Anda tidak boleh bersembang individu ini kerana anda telah menyekatnya.";
"SKERROR_CONTACTBLOCKED_SMS_FAILUREREASON" = "Anda tidak boleh menghantar SMS kepada individu ini kerana anda telah menyekatnya.";
"SKERROR_CONTACTBLOCKED_ADD_FAILUREREASON" = "Anda tidak boleh menambah individu ini kerana anda telah menyekatnya.";

/* SKErrorCantTalkToYourself */
"SKERROR_CANTTALKTOYOURSELF_CALL_FAILUREREASON" = "Anda tidak boleh memanggil diri anda.";
"SKERROR_CANTTALKTOYOURSELF_CHAT_FAILUREREASON" = "Anda tidak boleh bersembang dengan diri anda.";
"SKERROR_CANTTALKTOYOURSELF_ADD_FAILUREREASON"  = "Anda tidak boleh menambah diri anda.";

/* SKErrorCantJoinConversation */
"SKERROR_CANTJOINCONVERSATION_FAILUREREASON" = "Anda tidak boleh menyertai perbualan ini";

/* SKErrorCantFindConversation */
"SKERROR_CANTFINDCONVERSATION_FAILUREREASON" = "Tidak dapat mencari perbualan ini";

/* SKErrorInvalidPSTNNumber */
"CMEMBER_PSTN_STATUSTEXT_INVALIDNUMBER" = "Nombor telefon tersebut tidak sah.";

/* SKErrorEmergencyPSTNNumber */
"SKERROR_EMERGENCYCALL_FAILUREREASON" = "Anda tidak boleh memanggil nombor ini kerana ia nombor kecemasan.";
"SKERROR_EMERGENCYSMS_FAILUREREASON" = "Anda tidak boleh menghantar SMS kepada nombor ini kerana ia nombor kecemasan.";
"SKERROR_EMERGENCYADD_FAILUREREASON" = "Anda tidak boleh menambah nombor ini kerana ia nombor kecemasan.";

/* SKErrorCallExists */
"SKERROR_CALLEXISTS_CALL" = "Anda perlu menamatkan panggilan ini sebelum anda boleh memulakan yang baru.";
"SKERROR_CALLEXISTS_VOICEMAIL" = "Untuk mendengar mesej suara, tamatkan panggilan ini terlebih dahulu.";
"SKERROR_CALLFAILED" = "Panggilan gagal. Sila cuba lagi.";

/* SKErrorTooManyChatParticipants */
"SKERROR_TOOMANYPARTICIPANTS_CHAT_DESCRIPTION" = "Anda telah mencuba untuk memulakan perbualan dengan terlalu banyak kenalan.";

/* SKErrorInvalidConversationIdentities */
"SKERROR_INVALIDCONVERSATIONIDENTITIES_DESCRIPTION" = "Anda tidak boleh mengadakan perbualan dengan kenalan ini.";

/* CMEMBER_FAILUREREASON */
"CMEMBER_FAILUREREASON_CALLER_NOT_AUTHORIZED" = "Anda tidak boleh memanggil individu ini kerana mereka masih belum menerima permintaan kenalan anda.";
"CMEMBER_FAILUREREASON_CALLER_NOT_FRIEND" = "Anda tidak boleh memanggil individu ini kerana mereka masih belum menerima permintaan kenalan anda.";

/* SMS_FAILUREREASON */
"Sms::INVALID_CONFIRMATION_CODE" = "Kod pengesahan tidak sah";
"Sms::MISC_ERROR" = "Nombor telefon tidak sah";

/* Conversation::PREMIUM_VIDEO_STATUS */

/*
"PV_RESULT_400_BAD_REQUEST_SOME_FIELDS_MISSING_MESSAGE" = "PV_RESULT_400_BAD_REQUEST_SOME_FIELDS_MISSING_MESSAGE";
"PV_RESULT_401_P2P_BLOCK_MESSAGE" = "PV_RESULT_401_P2P_BLOCK_MESSAGE";
*/

"PV_RESULT_403_PAID_SERVICE_BLOCK_MESSAGE" = "Akaun anda telah disekat.";
"PV_RESULT_403_PAID_SERVICE_BLOCK_EXPLANATION" = "Sila hubungi sokongan pelanggan.";

"PV_RESULT_405_GROUP_TOO_LARGE_MESSAGE" = "Terdapat terlalu banyak orang dalam panggilan ini untuk video kumpulan.";
"PV_RESULT_405_GROUP_TOO_LARGE_EXPLANATION" = "Anda hanya boleh mengadakan panggilan video dengan sehingga 9 orang. Alih keluar orang dari kumpulan ini dan cuba lagi.";

/*
"PV_RESULT_410_NO_VALID_SUBSCRIPTION_BUT_TRIAL_IS_AVAILABLE_MESSAGE" = "PV_RESULT_410_NO_VALID_SUBSCRIPTION_BUT_TRIAL_IS_AVAILABLE_MESSAGE";
*/

"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_MESSAGE" = "Terdapat terlalu banyak orang dalam panggilan ini untuk video kumpulan.";
"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_EXPLANATION_BETA" = "Anda hanya boleh mengadakan panggilan video dengan sehingga 9 orang. Alih keluar orang dari perbualan ini dan cuba lagi.";
"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_EXPLANATION" = "Langganan panggilan video kumpulan anda tidak meliputi bilangan orang yang sebanyak ini. Alih keluar orang dari perbualan ini dan cuba lagi.";

"PV_RESULT_414_NO_SUBSCRIPTION_MESSAGE_BETA" = "Anda memerlukan langganan untuk panggilan video kumpulan.";
"PV_RESULT_414_NO_SUBSCRIPTION_MESSAGE" = "Anda memerlukan langganan untuk panggilan video kumpulan.";
"PV_RESULT_414_NO_SUBSCRIPTION_EXPLANATION_BETA" = "Ingin membuat panggilan video kumpulan?";
"PV_RESULT_414_NO_SUBSCRIPTION_EXPLANATION" = "Ingin membuat panggilan video kumpulan?";

"PV_RESULT_416_SUBSCRIPTION_IS_ALREADY_IN_USE_MESSAGE" = "Anda sudah berada dalam panggilan video kumpulan.";
"PV_RESULT_416_SUBSCRIPTION_IS_ALREADY_IN_USE_EXPLANATION" = "Anda hanya boleh membuat satu panggilan video kumpulan pada satu-satu masa.";

"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_MESSAGE" = "Anda telah mencapai had untuk panggilan ini.";
"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_EXPLANATION_BETA" = "Anda telah mencapai had video kumpulan 4 jam anda untuk panggilan ini.";
"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_EXPLANATION" = "Anda telah mencapai had video kumpulan 4 jam anda untuk panggilan ini. Semak akaun anda untuk butiran.";

"PV_RESULT_422_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_DAY_LIMIT_REACHED_MESSAGE" = "Anda telah mencapai had video kumpulan anda untuk panggilan ini.";
"PV_RESULT_422_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_DAY_LIMIT_REACHED_EXPLANATION" = "Panggilan video kumpulan tergantung buat sementara waktu. Anda telah mencapai had penggunaan yang ditetapkan untuk hari ini. Semak akaun anda untuk butiran.";

"PV_RESULT_424_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_MONTH_LIMIT_REACHED_MESSAGE" = "Anda telah mencapai had video kumpulan anda untuk bulan ini.";
"PV_RESULT_424_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_MONTH_LIMIT_REACHED_EXPLANATION" = "Panggilan video kumpulan tergantung buat sementara waktu. Anda telah mencapai had penggunaan yang ditetapkan untuk bulan ini. Semak akaun anda untuk butiran.";

/*
"PV_RESULT_430_GRACE_TIME_EXPIRED_MESSAGE" = "RESULT_430_GRACE_TIME_EXPIRED";
*/

"PV_RESULT_500_GENERAL_SERVICE_ERROR_MESSAGE" = "Video kumpulan tidak tersedia buat masa ini.";
"PV_RESULT_500_GENERAL_SERVICE_ERROR_EXPLANATION" = "Ralat telah berlaku. Sila cuba lagi kemudian.";

/*
"PV_RESULT_503_SERVICE_TIMEOUT_MESSAGE" = "RESULT_503_SERVICE_TIMEOUT";
*/

"PremiumVideoErrorRecovery_GetPremium_BETA" = "Dapatkan video kumpulan";
"PremiumVideoErrorRecovery_GetPremium" = "Dapatkan video kumpulan";
"PremiumVideoErrorRecovery_UpgradePremium" = "Naik taraf";

/* ===== SKAccessSessionFailureReasonErrorDomain Errors ===== */

"AccessSession::NO_BALANCE" = "Anda memerlukan Kredit Skype untuk menggunakan WiFi Skype.";
"AccessSession::LOGIN_FAILURE" = "Kami tidak mengenali Nama Skype dan kata laluan anda.";
"AccessSession::WISPR_LOGIN_REJECTED" = "Nama pengguna atau kata laluan tidak sah.";

"SKYPEACCESS_NO_ACCOUNT" = "Sila daftar masuk dengan Akaun Skype anda.";

"SKYPEACCESS_GENERIC_CONNECTION_ERROR" = "Tidak dapat menyambung. Semak kekuatan isyarat WiFi anda atau cuba kawasan liputan yang lain.";
"SKYPEACCESS_GENERIC_FATAL_ERROR" = "Kawasan liputan ini tidak memberi respons dengan betul. Sila cuba kawasan liputan yang lain.";

"SKYPEACCESS_SESSION_EXTEND_ERROR" = "Tidak dapat melanjutkan sesi. Cuba menyambung sekali lagi.";

"SKYPEACCESS_SESSION_LOSTWIFI_MESSAGE" = "Rangkaian WiFi “%@” tidak lagi tersedia";
"SKYPEACCESS_SESSION_LOSTWIFI_EXPLANATION" = "Untuk mengelakkan caj luar jangkaan, sentiasa putuskan sambungan dengan betul sebelum keluar dari kawasan liputan atau matikan peranti anda.";

"SKYPEACCESS_SESSION_LOSTWIFI_RECOVERABLE_MESSAGE" = "Sila sertai semula rangkaian WiFi “%@”";
"SKYPEACCESS_SESSION_LOSTWIFI_RECOVERABLE_EXPLANATION" = "WiFi Skype akan mencuba untuk menghentikan sambungan Internet anda. Untuk mengelakkan caj luar jangkaan, sentiasa putuskan sambungan dengan betul sebelum keluar dari kawasan liputan atau matikan peranti anda.";

"SKYPEACCESS_SESSION_LOSTWIFI_AUTO_END_MESSAGE" = "Sambungan Internet anda telah dihentikan.";

"ACCESS_PRICE_PER_MINUTE_FORMAT" = "%@ setiap minit";
"ACCESS_PRICE_PER_MINUTE_FREE" = "Percuma";

/*
 * ===========
 * SkyLib localization (Skype Kit messages sent by SkyLib to other clients)
 * ===========
 */

/* Message sent in the P2P chat after it has been migrated to a server-based chat, and seen by legacy client users. */
"LOCALIZED_UPGRADE_MESSAGE_IN_P2P" = "telah mengemas kini kumpulan ini dengan pengalaman sembang yang lebih baik.\nUntuk menyertai dan meneruskan sembang, dapatkan muat turun terkini.\nPergi ke <a href=\"http://www.skype.com/updateme\">Skype.com/updateme</a>.";
"LOCALIZED_UPGRADE_MESSAGE_IN_P2P_DOGFOOD" = "telah mengemas kini kumpulan ini dengan pengalaman sembang yang lebih baik.\nUntuk menyertai dan meneruskan sembang, dapatkan muat turun terkini.\nPergi ke https://microsoft.sharepoint.com/teams/DogfoodSkype/.";

/* Message sent in the server-based chat as first message. Used to link the history of both conversations. The '%1' is replaced with the ID of the old chat. */
"LOCALIZED_UPGRADE_MESSAGE_IN_SERVER_BASED" = "Klik <a href=\"skype:?chat&amp;id=%1\">di sini</a> untuk melihat sejarah terdahulu.";
